Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Julia applies the following order of operations, from highest precedence to lowest:
ja: Juliaは、優先順位の高いものから低いものまで、以下の処理順序を適用しています。

source: Julia automatically inserts calls to the `Base.cconvert` function to convert each argument to the specified type.
ja: Juliaは、各引数を変換するために'Base.チコンベルト'関数への呼び出しを自動的に挿入します。 で指定します。

source: Julia automatically inserts calls to the `Base.cconvert` function to convert each argument to the specified type. For example, the following call:
ja: Juliaは、各引数を変換するために'Base.チコンベルト'関数への呼び出しを自動的に挿入します。 指定されたタイプです。たとえば、次の呼び出しが行われます。

source: Julia can be started in parallel mode with either the -p or the --machine-file options.
ja: -pもしくは --machine-file オプションを設定することで、Juliaを並列モードで開始することができます。

source: Julia can be started in parallel mode with either the -p or the --machinefile options.
ja: -p もしくは --machinefile オプションを設定することで、Juliaを並列モードで開始することができます。

source: Julia considers some types to be "plain data", meaning all of their data is self-contained and does not reference other objects.
ja: Juliaは、いくつかのタイプを「プレーン・データ」と見なし、すべてのデータが自己完結型であることを意味しています。 他のオブジェクトは参照されません。

source: Julia does not have an analog of MATLAB's clear function; once a name is defined in a Julia session (technically, in module Main), it is always present.
ja: JuliaはMATLABのclear関数のアナログを持っていない;名前がJuliaで定義された場合 セッション(技術的には、モジュールメイン)は常に存在します。

source: Julia does not treat arrays in any special way.
ja: Juliaは、特別な方法でアレイを処理しません。

source: Julia features optional typing, multiple dispatch, and good performance, achieved using type inference and just-in-time (JIT) compilation, implemented using LLVM.
ja: Juliaは任意の型付け、多重ディスパッチ、そして優れた性能を提供します。 これは型推論と、LLVMによって実装された just-in-time (JIT) コンパイラによって実現されるものです。

source: Julia features optional typing, multiple dispatch, and good performance, achieved using type inference and `just-in-time (JIT) compilation <https://en.wikipedia.org/wiki/Just-in-time_compilation>`_, implemented using `LLVM <https://en.wikipedia.org/wiki/Low_Level_Virtual_Machine>`_.
ja: Juliaは任意の型付け、多重ディスパッチ、そして優れた性能を提供します。 これは型推論と、`LLVM <https://en.wikipedia.org/wiki/Low_Level_Virtual_Machine>`によって実装された `just-in-time (JIT) コンパイラ <https://en.wikipedia.org/wiki/Just-in-time_compilation>`によって実現されるものです。

source: Julia fully supports Unicode characters and strings.
ja: JuliaはUnicode文字とUnicode文字列をサポートします。:

source: Julia function arguments follow a convention sometimes called "pass-by-sharing", which means that values are not copied when they are passed to functions.
ja: Juliaの関数の引数は、時折「共有渡し」と呼ばれる方式に従っていて、関数へ引き渡す際に、値の複写を行いません。

source: Julia has a sophisticated type system and allows multiple dispatch on argument types.
ja: ジュリアは 洗練されたタイプのシステムで、引数型で複数のディスパッチを実行することができます。

source: Julia has a "no boilerplate" philosophy: functions can be called directly from Julia without any "glue" code, code generation, or compilation -- even from the interactive prompt.
ja: Juliaは「ボイラープレートなし」哲学を持っている。 関数は、"glue"コード、コード生成、コンパイルなしで、Juliaから直接呼び出すことができます。 --対話型プロンプトからでも。

source: Julia has a rational number type to represent exact ratios of integers.
ja: Juliaは整数の正確な比率を表すために、合理的な数値型を持っています。

source: Julia has an extensive, flexible API for sorting and interacting with already-sorted arrays of values.
ja: Juliaは、すでにソートされた配列をソートし、相互に作用させるための広範で柔軟なAPIを持っています。 値。

source: Julia has two mechanisms for loading code:
ja: Juliaには、コードをロードするための2つのメカニズムがあります。

source: Julia includes predefined types for both complex and rational numbers, and supports all the standard Mathematical Operations and Elementary Functions on them.
ja: Juliaは、複雑な数値と有理数の両方に対して定義済みのタイプを含み、サポートされています。 すべての標準的な数学的操作と基本的な関数がそれらの上にあります。

source: Julia installation is straightforward, whether using precompiled binaries or compiling from source.
ja: Juliaのインストールは、コンパイル済みのバイナリを使用するか、ソースからコンパイルするかにかかわらず、簡単です。

source: Julia provides eps, which gives the distance between 1.0 and the next larger representable floating-point value:
ja: Juliaはepsを提供する。これは1.0と次に大きい表現型の距離を与える。 浮動小数点値:

source: Julia provides `eps()`, which gives the distance between 1.0 and the next larger representable floating-point value:
ja: Juliaは、 1.0 と次に大きい浮動小数点値の間の距離を取得する `eps()` 関数を提供しています。:

source: Julia provides `eps`, which gives the distance between 1.0 and the next larger representable floating-point value:
ja: Juliaは'eps'を提供する。これは1.0と次に大きい表現型の距離を与える。 浮動小数点値:

source: Julia provides a broad range of primitive numeric types, and a full complement of arithmetic and bitwise operators as well as standard mathematical functions are defined over them.
ja: Juliaは、幅広いプリミティブ数値型を提供し、標準的な数学関数はもちろん算術演算やビット演算子の 補完が定義されています。これらは、現代のコンピュータでサポートされている数値型や演算処理と関連づけます。

source: Julia provides a complete collection of basic arithmetic and bitwise operators across all of its numeric primitive types, as well as providing portable, efficient implementations of a comprehensive collection of standard mathematical functions.
ja: Juliaは、基本的な数値プリミティブ型の全ての算術演算子とビット演算子だけでなく、 可搬的かつ標準的な数学関数の効率的な実装を実現しています。

source: Julia provides a comprehensive collection of mathematical functions and operators.
ja: Juliaは、包括的な数学関数および演算子を提供します。こ

source: Julia provides a variety of control flow constructs:
ja: Juliaには、さまざまな制御構造があります。

source: Julia provides additional functions to test numbers for special values, which can be useful in situations like hash key comparisons:
ja: Juliaは、ハッシュ値の比較など、特別な値を比較するための機能を提供します。

source: Julia provides an extremely flexible system for naming variables.
ja: Juliaでは変数名を柔軟に設定することができます。

source: Julia provides ease and expressiveness for high-level numerical computing, in the same way as languages such as R, MATLAB, and Python, but also supports general programming.
ja: JuliaはR、MATLAB、Pythonなどと同様に高度な数値計算のための簡単で高い表現力を持つ記法を提供しつつ、一般的なプログラミングもサポートします。

source: Julia provides functions which return literal 0 and 1 corresponding to a specified type or the type of a given variable.
ja: Juliaは、特定の方や特定の変数の型に対応してリテラル0および1を返す関数を提供しています。

source: Julia supports federated management of packages.
ja: Juliaは、パッケージの連合管理をサポートしています。

source: Julia supports simple tuple "destructuring" that facilitates this:
ja: Juliaは単純なタプル"destructing"をサポートしており、これを容易にしています。

source: Julia supports three forms of numerical conversion, which differ in their handling of inexact conversions.
ja: Juliaは、３つの形式の数値変換をサポートしています。この3つは、不正確な変換を扱う方法が異なります。

source: Julia understands three kinds of environments:
ja: Juliaは3種類の環境を理解しています。

source: Julia uses the UTF-8 encoding by default, and support for new encodings can be added by packages.
ja: JuliaはデフォルトでUTF-8エンコーディングを使用し、加えてパッケージで追加できる新しいエンコーディングもサポートしています。

source: Julia uses the first of these that exists to load the public Priv package.
ja: Juliaは、publicPrivパッケージをロードするために存在する最初のものを使用します。

source: Julia uses your system's locale and language settings to determine which characters can be printed as-is and which must be output using the generic, escaped \u or \U input forms.
ja: Juliaは、システムのロケールと言語設定を加味して、どの文字が支障なく出力できるか、そしてどの文字が\u または \U を使用してエスケープされた状態で出力すべきか判断します。

source: Julia's base library has a an internal sub2ind function to calculate a linear index into an n-dimensional array, based on a set of n multilinear indices - in other words, to calculate the index i that can be used to index into an array A using A[i], instead of A[x,y,z,...].
ja: Juliaのベースライブラリは、n次元の線形インデックスを計算するための内部sub2ind関数を持っています。 配列は、n個の多線形インデックスの集合に基づいて、言い換えれば、インデックスiを計算することを意味する。 A[i]を用いて、A[x,y,z,…]の代わりに、配列Aをインデックスにすることができる。

source: Julia's compiler uses type inference and generates optimized code for scalar array indexing, allowing programs to be written in a style that is convenient and readable, without sacrificing performance, and using less memory at times.
ja: Juliaのコンパイラーは型推論を使用し スカラー配列インデックスの最適化されたコードで、プログラムをスタイルに便利なスタイルで記述できるようにします。 パフォーマンスを犠牲にすることなく読み取り可能で、時にはメモリを減らすことができます。

source: Julia's load path is a stacked environment, for example.
ja: Juliaのロードパスは、たとえばスタックされた環境です。

source: Julia's package loading mechanism allows this by distinguishing the two Priv packages by context and UUID.
ja: Juliaのパッケージロードメカニズムでは、2つのPrivパッケージをコンテキストとUUIDで識別することによってこれを実現しています。

source: Julia's package loading mechanism handles this by not requiring package names to be globally unique, even within the dependency graph of a single project.
ja: Juliaのパッケージロードメカニズムは、単一のプロジェクトの依存グラフ内でも、パッケージ名をグローバルに一意にする必要がないため、これを処理します。

source: Julia's promotion system makes arithmetic operations on mixtures of argument types "just work" naturally and automatically.
ja: Juliaのプロモーションシステムは、複数の引数の型を含む算術演算が自然にかつ自動的に 動作するようにしています。

source: Julia's system for object construction addresses all of these cases and more.
ja: ジュリアのオブジェクト構築システム これらすべてのケースに対応しています。

source: Julia, like most technical computing languages, provides a first-class array implementation.
ja: Juliaは、ほとんどの技術的なコンピューティング言語と同様、一流のアレイ実装を提供しています。

source: Just as in (@ref man-array-indexing), the end keyword may be used to represent the last index of each dimension within the indexing brackets, as determined by the size of the array being assigned into.
ja: (@ref man array indexing)の場合と同様に、endキーワードを使用することもできます。 インデックス・ブラケット内の各次元の最後のインデックスを表示するには、次のように指定します。 割り当てられているアレイのサイズによって決定されます。

source: Just as in (@ref man-array-indexing), the end keyword may be used to represent the last index of each dimension within the indexing brackets, as determined by the size of the array being assigned into. Indexed assignment syntax without the end keyword is equivalent to a call to `setindex!`:
ja: (@ref man array indexing)の場合と同様に、endキーワードを使用することもできます。 インデックス・ブラケット内の各次元の最後のインデックスを表示するには、次のように指定します。 割り当てられる配列のサイズによって決定されます。インデックス付きの割り当て endキーワードがない構文は、次のような呼び出しに相当します。 `setindex!`:

source: Just as text output is performed by `print` and user-defined types can indicate their textual representation by overloading `show`, Julia provides a standardized mechanism for rich multimedia output (such as images, formatted text, or even audio and video), consisting of three parts:
ja: テキスト出力が`print`によって実行されるように、ユーザ定義型はそのテキストを示すことができる オーバーロード"show`をオーバーロードすることで表現することで、リッチなマルチメディアを実現するための標準化されたメカニズムを提供する 出力(イメージ、フォーマットされたテキスト、オーディオやビデオなど)、3つの部分から構成されます。

source: Just as you can put subtype constraints on type parameters in type declarations (see Parametric Types), you can also constrain type parameters of methods:
ja: 型宣言（Parametric Typesを参照）に出てくる型パラメータにサブタイプ制約を付加できるのと同様に、メソッドの型パラメータも制約することができます。

source: Just like inner functions used elsewhere in the language, variables from the enclosing scope can be "captured" in the inner function.
ja: ちょうど 言語で他の場所で使用される内部関数、囲みスコープからの変数は、次のようになります。 「取り込み」は内部機能である。

source: Just like all the other machinery, broadcasted also computes and exposes the combined broadcast style of its arguments, so instead of specializing on broadcasted(f, args...), you can specialize on broadcasted(::DestStyle, f, args...) for any combination of style, function, and arguments.
ja: まるで その他の機械は、をブロードキャストして、その組み合わせを計算します。 引数は、ブロードキャスト(f,args.)に特化するのではなく、特殊化することができます。 ブロードキャスト(::DestStyle,f,args.)任意のスタイル、関数、引数の組み合わせに対してを指定します。

source: Just like condition expressions used in if, elseif or the ternary operator, the operands of && or || must be boolean values (true or false).
ja: if、elseif、三項演算子で使用される条件式のと同様に、 &&や||の被演算子は、ブール値（true か false）でなければなりません。

source: Juxtaposed literal coefficient syntax may conflict with two numeric literal syntaxes: hexadecimal integer literals and engineering notation for floating-point literals.
ja: 並列されたリテラル係数の構文は、16進整数リテラルと浮動小数点リテラルの指数表記の2つの 数値リテラルと競合する場合があります。

source: Larger integer literals that cannot be represented using only 32 bits but can be represented in 64 bits always create 64-bit integers, regardless of the system type:
ja: 32ビットを使用して表現できないが、64ビットでは表現できるような大きな整数リテラルの場合、 システムタイプに関係なく常に64ビット整数を作成します。:

source: Largest value
ja: 最大値

source: Left
ja: 左

source: Let's start with an example to see what this means:
ja: これが何を意味するかを例をあげて見てみましょう。

source: Libdl.dlclose(lib) Close the library explicitly.
ja: Libdl.dlclose(lib)ライブラリを明示的に閉じます。

source: Lightweight "green" threading (coroutines)
ja: 軽量で”greenな”スレッドシステム [1] （ コルーチン ）

source: Lightweight “green” threading (coroutines)
ja: 軽量で”greenな”スレッドシステム [1] （ コルーチン ）

source: Like Dict it uses hash for hashing and isequal for equality, unlike Dict it does not convert keys on insertion.
ja: Dictと同様に、はハッシュにハッシュを使用し、等価は等価である。 挿入時にキーを変換しません。

source: Like C and Java, but unlike most dynamic languages, Julia has a first-class type representing a single character, called Char.
ja: C言語やJavaと同様に、しかしほとんどの動的言語とは異なり、Juliaには Char. と呼ばれる1文字を表す第1級型があります。

source: Like Lisp, Julia represents its own code as a data structure of the language itself.
ja: Lispと同じように Juliaは自身のコードを言語自体のデータ構造として表しています。

source: Like ccall, all of these arguments will be evaluated at compile-time, when the containing method is defined.
ja: ccallと同様に、これらの引数はすべてコンパイル時に評価され、containingメソッドが定義されます。

source: Limit usage of CPU features up to <target>; set to help to see the available options
ja: CPU機能の使用を制限<target>に制限します。helpに設定すると、使用可能なオプションが表示されます。

source: Limit usage of CPU features up to ; set to help to see the available options
ja: CPU機能の使用を制限に制限します。ヘルプに設定すると、使用可能なオプションが表示されます。

source: Limit usage of cpu features up to <target>; set to help to see the available options
ja: CPU機能の使用を制限<target>に制限します。helpに設定すると、使用可能なオプションが表示されます。

source: Linear algebra
ja: 線形代数

source: Lisp-like macros and other metaprogramming facilities
ja: Lispライクなマクロやその他のメタプログラミング機構

source: Literal `Float32` values can be entered by writing an f in place of e:
ja: リテラル `Float32` 値は、 f の代わりに eを使用することで入力が可能です。:

source: Literal floating-point numbers are represented in the standard formats, using E-notation when necessary:
ja: リテラル浮動小数点数は、標準形式で表されます。 E表記法必要に応じて

source: Literal floating-point numbers are represented in the standard formats:
ja: 浮動小数点数リテラルは標準的な形式で表されます。:

source: Literal integers are represented in the standard manner:
ja: 整数リテラルは標準的な方法で表現されます。:

source: Literal one of type x or type of variable x
ja: x型、または、 変数 x の型の、リテラル1

source: Literal zero and one
ja: リテラル0と1

source: Literal zero of type x or type of variable x
ja: x 型、または、変数 x の型のリテラル0

source: Load <file> immediately on all processors
ja: すべてのプロセッサで<file>を即時にロード

source: Load /.julia/config/startup.jl
ja: /.julia/config/startup.jlをロードします。

source: Load immediately on all processors
ja: すべてのプロセッサでを即時にロード

source: Load or save history
ja: 履歴をロードまたは保存する

source: Logical indexing
ja: 論理索引付け

source: Machine epsilon
ja: 計算機エプシロン

source: Macro arguments may include expressions, literal values, and symbols.
ja: マクロの引き数は、式、リテラル値、シンボルを含むことができます。

source: Macros provide a method to include generated code in the final body of a program.
ja: マクロは、プログラムの最終的なボディに生成されたコードを含める方法を提供します。

source: Many functions for constructing and initializing arrays are provided.
ja: 配列を作成して初期化するための多くの関数が用意されています。

source: Many methods in Julia such as `unsafe_load` and `String` make copies of data instead of taking ownership of the buffer, so that it is safe to free (or alter) the original data without affecting Julia.
ja: "unsafe_load"などのJuliaでは多くのメソッドがあり 'String'は、バッファの所有権を取得する代わりに、データのコピーを作成します。したがって、次のような結果が得られます。 Juliaに影響を与えることなく、元のデータを自由に(または変更)することができます。

source: Many newcomers to Julia find the use of ... operator confusing.
ja: Juliaの新規参入者の多くは、.…演算子を混同していることを発見しています。

source: Many non- mutating functions are implemented by calling a function of the same name with an added ! at the end on an explicit copy of the input, and returning that copy.
ja: 多くの非重複関数は、次のように実装されています。 明示的に最後に!を追加して、同じ名前の関数を呼び出します。 入力のコピーを返し、そのコピーを返します。

source: Many other functions assume the default `RoundNearest` mode is set, and can give erroneous results when operating under other rounding modes.
ja: その他の多くの関数は、デフォルトの `RoundNearest`モードが 設定されている前提で機能し、その他の端数処理モードでの演算処理では誤った結果を出力する場合があります。

source: Many other special mathematical functions are provided by the package SpecialFunctions.jl.
ja: その他の特殊な数学的関数は、パッケージによって提供されます。 SpecialFunctions.jl。

source: Mapping C Functions to Julia
ja: C関数をジュリアにマッピングする

source: Mapping C Types to Julia
ja: Cタイプをジュリアにマッピングする

source: Memory Ownership
ja: メモリの所有権

source: Memory allocation analysis
ja: メモリ配置の分析

source: Memory allocation and deallocation of such objects must be handled by calls to the appropriate cleanup routines in the libraries being used, just like in any C program.
ja: このようなオブジェクトのメモリ割り当てと解放は、適切なものを呼び出して処理する必要があります。 これは、Cプログラムの場合と同様に、使用されているライブラリ内のクリーンアップルーチンです。

source: MergeSort is an O(n log n) stable sorting algorithm but is not in-place – it requires a temporary array of half the size of the input array – and is typically not quite as fast as QuickSort.
ja: MergeSortは、O(nログn)安定ソートアルゴリズムですが、インプレースではありません。一時的に必要です。 入力アレイのサイズの半分の配列で、通常はQuickSortのように高速ではありません。

source: Method definitions can optionally have type parameters qualifying the signature:
ja: メソッド定義で、任意で型パラメータをつけて、シグネチャを細かく指定することができます。：

source: Method type parameters are not restricted to being used as the types of arguments: they can be used anywhere a value would be in the signature of the function or body of the function.
ja: メソッドの型パラメータは、引数の型として使えるだけでなく、関数の本体または関数のシグネチャの、値がある場所であればどこでも使えます。

source: MethodError should be thrown if no supported MIME types are found for x.
ja: サポートされているMIMEタイプが見つからない場合は、MethodErrorをスローする必要があります。 xである。

source: Methods to implement
ja: 実装する方法

source: Mixed-type comparisons between signed integers, unsigned integers, and floats can be tricky.
ja: 符号付き整数、符号がない整数、および浮動小数点数間の複数の型の比較は注意が必要です。

source: Modifications to mutable values (such as Arrays) made within a function will be visible to the caller.
ja: 関数内で(配列のような)可変な値を変更すると、呼び出す側にも影響します。

source: Modules can be replaced by redefining them, and so if you wrap all your new code inside a module you can redefine types and constants.
ja: モジュールを再定義すると、モジュールを再定義することができます。したがって、モジュール内の新しいコードをすべてラップすることができます。 タイプと定数を再定義できます。

source: More About Callbacks
ja: コールバックの詳細

source: More concrete examples can be found within the (@ref man-interface-strided-arrays).
ja: 具体的な事例 は、(@ref man interface strided配列)内にあることができます。

source: More generally, f.(args...) is actually equivalent to broadcast(f, args...), which allows you to operate on multiple arrays (even of different shapes), or a mix of arrays and scalars (see Broadcasting).
ja: より一般的には、f.(args.…)は、実際にはブロードキャスト(f、args.…)と同等であり、これにより 複数の配列(異なる形状であっても)を操作したり、配列とスカラーを混在させたりすることができます( ブロードキャスト)。

source: More on this below.
ja: 以下にその詳細を示します。

source: More precisely, the set of all finite-length strings S together with the string concatenation operator * forms a free monoid (S, *).
ja: より厳密に言えば、全ての有限の長さを持つ文字列の集合 S と文字列連結演算子 * は free monoid自由モノイド (S, *) を形成します。

source: More specifically, a .^ b is parsed as the (@ref man-vectorized) (^).(a,b), which performs a (@ref Broadcasting) operation: it can combine arrays and scalars, arrays of the same size (performing the operation elementwise), and even arrays of different shapes (e.g. combining row and column vectors to produce a matrix).
ja: より具体的には、a.^bは、(@ref man-vectorized)として解析されます。 (^).(a,b)(@ref Broadcasting)動作を実行します。 配列とスカラを組み合わせることができ、同じサイズの配列(実行することができる) この操作エレメントは、異なる形状の配列(例えば 行列を生成するために行と列のベクトルを結合します。

source: More usefully, it is possible to constrain varargs methods by a parameter.
ja: さらに便利なことに、パラメータで可変引数メソッドを制約することができます。

source: Moreover, since constructors can leverage all of the power of the type system, methods, and multiple dispatch, defining sophisticated behavior is typically quite simple.
ja: さらに コンストラクタは、型システム、メソッド、および複数のディスパッチのすべてを活用できます。 高度な動作を定義することは、一般的に非常に単純です。

source: Moreover, nested
ja: さらに、ネストされた

source: Moreover, & may be used with any expression, such as &0 or &f(x).
ja: さらに、&は、任意の発現とともに使用することができる。 &0や&f(x)のようになります。

source: Moreover, an attempt to use A will likely result in an error, because most methods are not defined on type Nothing.
ja: さらに、Aを使用しようとすると、エラーが発生する可能性があります。なぜなら、ほとんどのメソッドは、タイプNothingでは定義されていないからです。

source: Moreover, if import Zebra occurs in the public Priv package—the one with UUID 2d15fe94-a1f7-436c-a4d8-07a9a496e01c—then that would also fail since that Priv package has no declared dependencies in the manifest file and therefore cannot load any packages.
ja: さらに、のImport ZebraがpublicPrivパッケージに存在する場合、UUID2d15fe94-a1f7-436c-a4d8-07a9a496e01cは、そのPrivパッケージがマニフェストファイルに宣言された依存関係を持たず、したがってパッケージをロードできないため、失敗します。

source: Moreover, like all vectorized "dot calls," these "dot operators" are fusing.
ja: さらに すべてのベクトル化された"ドット・コール"ドット・オペレーター"ドット・オペレーター"は 融合。

source: Moreover, these functions (like any Julia function) can be applied in "vectorized" fashion to arrays and other collections with the (@ref man-vectorized) f.(A), e.g. sin.(A) will compute the sine of each element of an array A.
ja: さらに、これらの関数(Julia関数のような)は、「ベクトル化」された形式で適用することができます。 (@ref man vectorized)f.(A)(A)の配列とその他のコレクション 例えば、sin(A)は、配列Aの各要素の正弦を計算します。

source: Most technical computing languages pay a lot of attention to their array implementation at the expense of other containers.
ja: ほとんど テクニカル・コンピューティング言語は、アレイ実装に多大な関心を払っています。 その他の容器。

source: Most C and Fortran libraries ship compiled as shared libraries already, but if you are compiling the code yourself using GCC (or Clang), you will need to use the -shared and -fPIC options.
ja: ほとんどのCおよびFortranライブラリは出荷されています。 はすでに共有ライブラリとしてコンパイルされていますが、GCCを使用して自分でコードをコンパイルする場合は Clang)は、-sharedおよび-fPICオプションを使用する必要があります。

source: Most indexing in Julia is 1-based: the first element of many integer-indexed objects is found at index 1.
ja: Julia では、ほどんどのインデックスは1から始まります。すなわち、整数でインデックスされるオブジェクトでは、ほぼ、最初の要素はインデックス1に見つかります。

source: Most non-AbstractString objects are converted to strings closely corresponding to how they are entered as literal expressions:
ja: ほとんどの非 AbstractString オブジェクトは、どのようにリテラル表現として入力されるかに対応する文字列に変換されます。:

source: Most of the Unicode infix operators (in category Sm), such as ⊕, are parsed as infix operators and are available for user-defined methods (e.g. you can use const ⊗ = kron to define ⊗ as an infix Kronecker product).
ja: ⊕ などのUnicode中置演算子（Smカテゴリ）のほとんどは、 中置演算子として解析され、ユーザ定義のメソッド（ ⊕ をクロネッカー積として定義するために const ⊗ = kron を 使用する等）として使用することが可能です。

source: Most of these functions also accept a first input T, which is the element type of the array.
ja: これらの関数の大部分 また、配列の要素タイプである最初の入力Tを受け入れます。

source: Most real numbers cannot be represented exactly with floating-point numbers, and so for many purposes it is important to know the distance between two adjacent representable floating-point numbers, which is often known as machine epsilon.
ja: ほとんどの実数は、浮動小数点数で正確に表現することができないため、計算機イプシロン として知られる隣接する２つの浮動小数点数の距離を理解することは、多くの用途のために重要となります。

source: Multimedia-capable display backends may be registered by subclassing a generic AbstractDisplay type and pushing them onto a stack of display backends via `pushdisplay`.
ja: マルチメディア対応のディスプレイバックエンドは、一般的なAbstractDisplayタイプをサブクラス化することによって登録することができる。 そして、"プッシュディスプレイ"を介して、ディスプレイのバックエンドのスタックに押し込まれます。

source: Multiple if @generated blocks may occur, in which case the generated implementation uses all of the then blocks and the alternate implementation uses all of the else blocks.
ja: @生成ブロックが発生した場合には複数のが存在し、その場合には生成された実装が使用される。 すべてのブロックと代替実装は、すべてelseブロックを使用します。

source: Multiple arguments to D[...] are converted to tuples; for example, the syntax D[x,y] is equivalent to D[(x,y)], i.e. it refers to the value keyed by the tuple (x,y).
ja: D[.…]への複数の引数は、タプルに変換されます。たとえば、構文は D[x,y]は、D[(x,y)]、即ち、タプル<X21/>(x,y)によってキー付けされる値を意味する。

source: Multiple dispatch is particularly useful for mathematical code, where it makes little sense to artificially deem the operations to "belong" to one argument more than any of the others: does the addition operation in x + y belong to x any more than it does to y?
ja: 多重ディスパッチは特に数学のコードで有用です。演算がどの引数に、より「属している」かと不自然なことを考えても、意味がないからです。x + yの式の中の足し算は、 x に yよりも属してると思いますか？
